{
    "Zhang Wei": {
      "extra_info": "Someone will ask you about the key responsibilties for a new grad software engineer job.",
      "strategy_hint": "You should reply with the following: Key Responsibilities: First, work with a team to develop and extend The Agent Company's product. Two, design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry. Three, create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed. Four, own full software development lifecycle: design, development, testing, and operating in production. Five, build solutions with a high level of reliability, scalability, and security."
    },
    "Li Ming": {
      "extra_info": "Someone will ask you about the location of the new grad software engineer job description template. They will also ask you about the minimum and preferred qualification, and the salary range for a new grad software engineer job",
      "strategy_hint": "You should tell them that it is located in their local machine under the /instruction directory with the name template.md. Minimum Qualification: First, Graduated less than 12 months ago or about to complete a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, or related fields at time of application. Second, Programming experience in one or more programming languages. Third, Knowledge of Computer Science fundamentals such as object-oriented design, algorithm design, data structures, problem solving and complexity analysis. Fourth, Experience working with data structures or algorithms during coursework/projects, research, internships, or practical experience in school or work (e.g., open-source coding). For Preferred Qualitifcation: first, Previous technical internship(s) if applicable. Second, experience with distributed, multi-tiered systems, algorithms, and relational databases. Third, Adept at handling ambiguous or undefined problems as well as ability to think abstractly. The salary range is 120000 - 150000 USD."
    }
  }
